Revit 2027 API
ConnectionWarning Enumeration
 An enumerated type listing all the reasons for connectivity failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConnectionWarning
Public Enumeration ConnectionWarning
public enum class ConnectionWarning
type ConnectionWarning
Members
Member name | Value | Description
Alignment | 1 |  Value for parts were moved when rebuilt so that connectors were no longer aligned.
Connectivity | 4 |  Value for fabrication Connectivity Mismatch.
Shape | 3 |  Value for shapes didn't match.
Size | 2 |  Value for sizes didn't match.
Unknown | 0 |  Value for unknown or unspecified reason.
See Also
Reference
Autodesk.Revit.DB Namespace